test/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server host="jasmin.headcraft.de" port="80" type="tcp"></server>
  </servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
       agent on the remote machine or SNMP. erlang is the default --> 
  <!--   <monitoring> -->
  <!--     <monitor host="myserver" type="snmp"></monitor> -->
  <!--   </monitoring> -->
  
  <!-- several arrival phases can be set: for each phase, you can set
       the mean inter-arrival time between new clients and the phase
       duration -->

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users interarrival="0.6" unit="second" maxnumber="500"></users>
    </arrivalphase>
  </load>

  <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <!-- start a session for a http user. the probability is the
       frequency of this type os session. The sum of all session's
       probabilities must be 100 -->

  <sessions>


    <session name='quick-visit' probability='56'  type='ts_http'>
      <request><http url='/' version='1.1' method='GET'></http></request>
      <request><http url='/index' version='1.1' method='GET'></http></request>
      <transaction name='en_index'>
	<request><http url='/en/index' version='1.1' method='GET'></http></request>
      </transaction>      
      
      <thinktime random='true' value='4'/>

      <transaction name='en_idea'>
	<request><http url='/en/idea' version='1.1' method='GET'></http></request>
      </transaction>      

      <thinktime random='true' value='6'/>

      <request><http url='/en/bestellung' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='4'/>

      <request><http url='/en/bos' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='5'/>

      <request><http url='/en/contact' version='1.1' method='GET'></http></request>
    </session>



    <session name='long visit sat infosystem' probability='9'  type='ts_http'>
      <request><http url='/' version='1.1' method='GET'></http></request>
      <request><http url='/index' version='1.1' method='GET'></http></request>
      <request><http url='/en/index' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='4'/>

      <request><http url='/infosystem?__sponsorid=&amp;__password=' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/de/satellitenkarte.htm' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/satellitenkarte_style.css' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/de/messages.js' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/MochiKit.js' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/javascript.js' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/bilder/head.gif' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/bilder/spacer.gif' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/bilder/uebersichtskarte_klein.gif' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/bilder/uebersicht_info2.gif' version='1.1' method='GET'></http></request>
      <request><http url='/sponsor-login' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/bilder/uebersicht_info1.gif' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/bilder/karte_uebersicht.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/m2-javascript/' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/bilder/lupe.gif' version='1.1' method='GET'></http></request>
      <request><http url='/poi-javascript' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='1'/>

      <request><http url='/images/palme.gif' version='1.1' method='GET'></http></request>
      <request><http url='/images/punkt.gif' version='1.1' method='GET'></http></request>
      <request><http url='/images/sale.gif' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='6'/>

      <request><http url='/overview/6120/6930' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6120/7020' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6120/7110' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6120/7200' version='1.1' method='GET'></http></request>


      <request><http url='/overview/6210/6930' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6210/7020' version='1.1' method='GET'></http></request>


      <request><http url='/overview/6210/7110' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6210/7200' version='1.1' method='GET'></http></request>


      <request><http url='/overview/6300/6930' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6300/7020' version='1.1' method='GET'></http></request>


      <transaction name='overview_6300_7110'>	
	<request><http url='/overview/6300/7110' version='1.1' method='GET'></http></request>
      </transaction>
      <request><http url='/overview/6300/7200' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6390/6930' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6390/7020' version='1.1' method='GET'></http></request>


      <request><http url='/overview/6390/7110' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6390/7200' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='3'/>

      <request><http url='/poi-image/agroforestry/1/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/poi-image/agroforestry/2/thumbnail,,55,55' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/agroforestry/3/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/172468/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/172442/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/172497/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/poi-image/agroforestry/4/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/172488/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/poi-image/agroforestry/5/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/poi-image/agroforestry/6/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/2435348/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/2435374/thumbnail,,55,55' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/agroforestry/1' version='1.1' method='GET'></http></request>
      <request><http url='/image/172442' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/agroforestry/2' version='1.1' method='GET'></http></request>
      <request><http url='/image/172468' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/agroforestry/6' version='1.1' method='GET'></http></request>
      <request><http url='/image/2435374' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/agroforestry/5' version='1.1' method='GET'></http></request>
      <request><http url='/image/2435348' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='1'/>

      <request><http url='/overview/5400/8280' version='1.1' method='GET'></http></request>
      <request><http url='/overview/5400/8370' version='1.1' method='GET'></http></request>
      <request><http url='/overview/5400/8460' version='1.1' method='GET'></http></request>
      <request><http url='/overview/5400/8550' version='1.1' method='GET'></http></request>


      <request><http url='/overview/5490/8280' version='1.1' method='GET'></http></request>
      <request><http url='/overview/5490/8370' version='1.1' method='GET'></http></request>


      <request><http url='/overview/5490/8460' version='1.1' method='GET'></http></request>
      <request><http url='/overview/5490/8550' version='1.1' method='GET'></http></request>


      <request><http url='/overview/5580/8280' version='1.1' method='GET'></http></request>
      <request><http url='/overview/5580/8370' version='1.1' method='GET'></http></request>


      <request><http url='/overview/5580/8460' version='1.1' method='GET'></http></request>


      <request><http url='/overview/5580/8550' version='1.1' method='GET'></http></request>


      <request><http url='/overview/5670/8280' version='1.1' method='GET'></http></request>
      <request><http url='/overview/5670/8370' version='1.1' method='GET'></http></request>


      <request><http url='/overview/5670/8460' version='1.1' method='GET'></http></request>
      <request><http url='/overview/5670/8550' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='2'/>

      <request><http url='/poi-image/amphibians/1/thumbnail,,55,55' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/amphibians/2/thumbnail,,55,55' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/amphibians/3/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/2463444/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/2463467/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/poi-image/amphibians/4/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/poi-image/amphibians/5/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/2463456/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/2463508/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/poi-image/amphibians/6/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/2463483/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/2463520/thumbnail,,55,55' version='1.1' method='GET'></http></request>


      <transaction name='poi_image_amphibians_5'>
	<request><http url='/poi-image/amphibians/5' version='1.1' method='GET'></http></request>
      </transaction>
      <request><http url='/image/2463508' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/amphibians/3' version='1.1' method='GET'></http></request>
      <request><http url='/image/2463467' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/amphibians/1' version='1.1' method='GET'></http></request>
      <request><http url='/image/2463444' version='1.1' method='GET'></http></request>


      <request><http url='/image/545876' version='1.1' method='GET'></http></request>
      <request><http url='/overview/4770/8100' version='1.1' method='GET'></http></request>
      <request><http url='/overview/4770/8190' version='1.1' method='GET'></http></request>
      <request><http url='/overview/4770/8280' version='1.1' method='GET'></http></request>


      <request><http url='/overview/4770/8370' version='1.1' method='GET'></http></request>


      <request><http url='/overview/4860/8100' version='1.1' method='GET'></http></request>
      <request><http url='/overview/4860/8190' version='1.1' method='GET'></http></request>
      <request><http url='/overview/4860/8280' version='1.1' method='GET'></http></request>


      <request><http url='/overview/4860/8370' version='1.1' method='GET'></http></request>
      <request><http url='/overview/4950/8190' version='1.1' method='GET'></http></request>
      <request><http url='/overview/4950/8100' version='1.1' method='GET'></http></request>


      <request><http url='/overview/4950/8280' version='1.1' method='GET'></http></request>


      <request><http url='/overview/4950/8370' version='1.1' method='GET'></http></request>


      <request><http url='/overview/5040/8100' version='1.1' method='GET'></http></request>
      <request><http url='/overview/5040/8190' version='1.1' method='GET'></http></request>


      <request><http url='/overview/5040/8280' version='1.1' method='GET'></http></request>
      <request><http url='/overview/5040/8370' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='2'/>

      <request><http url='/poi-image/fireprotection/1/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/poi-image/fireprotection/2/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/116975/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/poi-image/fireprotection/3/thumbnail,,55,55' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/fireprotection/4/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/116966/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/116957/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/116948/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/poi-image/fireprotection/5/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/poi-image/fireprotection/6/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/116939/thumbnail,,55,55' version='1.1' method='GET'></http></request>
      <request><http url='/image/2418751/thumbnail,,55,55' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/fireprotection/2' version='1.1' method='GET'></http></request>
      <request><http url='/image/116966' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/fireprotection/6' version='1.1' method='GET'></http></request>
      <request><http url='/image/2418751' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/fireprotection/4' version='1.1' method='GET'></http></request>
      <request><http url='/image/116948' version='1.1' method='GET'></http></request>


      <request><http url='/poi-image/fireprotection/1' version='1.1' method='GET'></http></request>
      <request><http url='/image/116975' version='1.1' method='GET'></http></request>


      <request><http url='/overview/6480/6120/background/areas/contracts' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6480/6210/background/areas/contracts' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6480/6300/background/areas/contracts' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6480/6390/background/areas/contracts' version='1.1' method='GET'></http></request>


      <request><http url='/overview/6570/6210/background/areas/contracts' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6570/6300/background/areas/contracts' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6570/6120/background/areas/contracts' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6570/6390/background/areas/contracts' version='1.1' method='GET'></http></request>


      <request><http url='/overview/6660/6120/background/areas/contracts' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='1'/>

      <request><http url='/overview/6660/6210/background/areas/contracts' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6660/6300/background/areas/contracts' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6660/6390/background/areas/contracts' version='1.1' method='GET'></http></request>


      <request><http url='/overview/6750/6120/background/areas/contracts' version='1.1' method='GET'></http></request>


      <request><http url='/overview/6750/6210/background/areas/contracts' version='1.1' method='GET'></http></request>


      <request><http url='/overview/6750/6300/background/areas/contracts' version='1.1' method='GET'></http></request>
      <request><http url='/overview/6750/6390/background/areas/contracts' version='1.1' method='GET'></http></request>


      <request><http url='/m2-javascript/6619/6213' version='1.1' method='GET'></http></request>
      <request><http url='/contract-image/3022835/ffff00' version='1.1' method='GET'></http></request>


      <request><http url='/m2-javascript/6611/6220' version='1.1' method='GET'></http></request>
      <request><http url='/contract-image/3024093/ffff00' version='1.1' method='GET'></http></request>


      <request><http url='/m2-javascript/6627/6221' version='1.1' method='GET'></http></request>
      <request><http url='/contract-image/3024109/ffff00' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='1'/>

      <request><http url='/m2-javascript/6609/6206' version='1.1' method='GET'></http></request>
      <request><http url='/contract-image/3020038/ffff00' version='1.1' method='GET'></http></request>
      <request><http url='/m2-javascript/6616/6208' version='1.1' method='GET'></http></request>
      <request><http url='/contract-image/3020046/ffff00' version='1.1' method='GET'></http></request>


      <request><http url='/m2-javascript/6630/6208' version='1.1' method='GET'></http></request>
      <request><http url='/contract-image/3020060/ffff00' version='1.1' method='GET'></http></request>


      <request><http url='/m2-javascript/6609/6211' version='1.1' method='GET'></http></request>
      <request><http url='/contract-image/3022823/ffff00' version='1.1' method='GET'></http></request>


      <request><http url='/m2-javascript/6601/6221' version='1.1' method='GET'></http></request>
      <request><http url='/contract-image/3024083/ffff00' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='1'/>

      <request><http url='/m2-javascript/6609/6225' version='1.1' method='GET'></http></request>
      <request><http url='/contract-image/3026757/ffff00' version='1.1' method='GET'></http></request>
      <request><http url='/m2-javascript/6621/6225' version='1.1' method='GET'></http></request>
      <request><http url='/contract-image/3026773/ffff00' version='1.1' method='GET'></http></request>


      <request><http url='/m2-javascript/6626/6220' version='1.1' method='GET'></http></request>


      <request><http url='/m2-javascript/6627/6225' version='1.1' method='GET'></http></request>
      <request><http url='/contract-image/3026777/ffff00' version='1.1' method='GET'></http></request>
    </session>

    <session name='buy-sqm' probability='35'  type='ts_http'>
      <request><http url='/' version='1.1' method='GET'></http></request>
      <request><http url='/index' version='1.1' method='GET'></http></request>
      <request><http url='/en/index' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='7'/>

      <request><http url='/' version='1.1' method='GET'></http></request>
      <request><http url='/index' version='1.1' method='GET'></http></request>
      <request><http url='/en/index' version='1.1' method='GET'></http></request>
      <request><http url='/static/toplevel_style.css' version='1.1' method='GET'></http></request>
      <request><http url='/static/content_style.css' version='1.1' method='GET'></http></request>
      <request><http url='/static/bos.js' version='1.1' method='GET'></http></request>
      <request><http url='/favicon.ico' version='1.1' method='GET'></http></request>
      <request><http url='/images/header_ganzneu.gif' version='1.1' method='GET'></http></request>
      <request><http url='/images/pfeil_link_on.gif' version='1.1' method='GET'></http></request>
      <request><http url='/images/spenden.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/images/trans.gif' version='1.1' method='GET'></http></request>
      <request><http url='/infosystem/bilder/submit.gif' version='1.1' method='GET'></http></request>
      <request><http url='/images/start_pic_headline1.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/images/start_pic_headline2b.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/images/start_pic_headline3.jpg' version='1.1' method='GET'></http></request>
      <request><http url='/images/satellite_ganzneu2.gif' version='1.1' method='GET'></http></request>
      <request><http url='/images/bg_content_right.gif' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='7'/>

      <request><http url='/de/index' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='3'/>

      <request><http url='/de/bestellung' version='1.1' method='GET'></http></request>
      <request><http url='/images/step1.gif' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='7'/>
      <transaction name='buy_sqm'>	      
	<request>
	  <!-- 	<dyn_variable name="contract_id"  -->
	  <!--                       regexp='input +value="([0-9]+)" +name="contract-id" +type="hidden"'/> -->
	  <dyn_variable name="contract_id" regexp='contract-id=\([0-9]*\)'></dyn_variable>
	  <http url='/de/buy-sqm'
		version='1.1'
		contents='numsqm=1&amp;numsqm1=&amp;disclaimer_read=1&amp;action=%C3%9Cberweisen'
		content_type='application/x-www-form-urlencoded' method='POST'></http>
	</request>
	<request><http url='/images/step3.gif' version='1.1' method='GET'></http></request>
      </transaction>
      
      <thinktime random='true' value='7'/>

      <request><http url='/admin' version='1.1' method='GET'></http></request>
      <request><http url='/login' version='1.1' method='GET'></http></request>
      <request><http url='/static/cms.css' version='1.1' method='GET'></http></request>
      <request><http url='/images/bos-logo.gif' version='1.1' method='GET'></http></request>

      <thinktime random='true' value='4'/>

      <transaction name='admin_login_pay_contract'>	      
	<request><http url='/login' version='1.1'  contents='__username=kilian&amp;__password=emusik&amp;action=login' content_type='application/x-www-form-urlencoded' method='POST'></http></request>
	<request><http url='/admin' version='1.1' method='GET'></http></request>
	<request><http url='/static/cms.js' version='1.1' method='GET'></http></request>
	<request><http url='/static/tiny_mce/tiny_mce.js' version='1.1' method='GET'></http></request>
	
	<request subst="true">
	  <http url='/pay-contract?contract-id=%%_contract_id%%&amp;name=TestSponsor' version='1.1' method='GET'></http>
	</request>
      </transaction>
    </session>

  </sessions>
</tsung>